package com.ebusbar.param;

/**
 * Created by Jelly on 2016/3/29.
 */
public enum NetErrorEnum {

    操作成功("100","网络操作成功"),
    用户已经注册("101","用户已经注册，请直接登录"),
    登录密码格式错误("102","登录密码格式错误，请重新输入登录密码"),
    支付密码格式错误("103","支付密码格式错误，请重新输入支付密码"),
    用户已经加入黑名单("104","用户已经暂停使用"),
    验证码错误("105","验证码错误，请重新输入验证码"),
    手机号码格式错误("106","手机号码格式错误，请检查手机号码"),
    访问超时("500","访问超时"),
    参数错误("600","参数错误"),
    登录验证码错误("108","登录验证码错误，请重新输入"),
    账户不存在("109","账户不存在，请先注册"),
    Token失效("110","用户已经注销，请重新登录"),
    新增失败("111","新增失败"),
    删除失败("112","删除失败"),
    更新失败("113","更新失败"),
    余额不足("114","您的系统余额已不足"),
    支付密码错误("115","支付密码错误，请重新输入支付密码"),
    充电接口未插上("116","充电接口未插上"),
    电桩不可用("117","对不起，您慢了一步，已经被别人抢先了"),
    登录密码错误("118","登录密码错误"),
    充电卡已经被绑定("119","充电卡已经被绑定"),
    支付金额不正确("120","支付金额不正确"),
    订单状态不可支付("121","订单状态不可支付"),
    充电卡不存在("122","充电卡不存在"),
    充电卡密码错误("123","充电卡密码错误"),
    无效的二维码("124","您输入的二维码有误，请重新输入"),
    有未完成订单("125","有未完成订单");
    /**
     * 错误码
     */
    private String state;
    /**
     * 提示信息
     */
    private String msg;

    NetErrorEnum(String state, String msg) {
        this.state = state;
        this.msg = msg;
    }

    public String getState() {
        return state;
    }

    public void setState(String state) {
        this.state = state;
    }

    public String getMsg() {
        return msg;
    }

    public void setMsg(String msg) {
        this.msg = msg;
    }


}
